Revit 2024 API
PartType Enumeration
 An enumerated type listing all MEP family part types. A part type typically provides one unique set of type parameters that defines this part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum PartType
Visual Basic
Public Enumeration PartType
Visual C++
public enum class PartType
Members
Member name | Description
Undefined |  Undefined part type
Normal |  Normal part type
DuctMounted |  Duct mounted part type
JunctionBox |  JunctionBox part type
AttachesTo |  Attaches to part type
BreaksInto |  Breaks into part type
Elbow |  Elbow part type
Tee |  Tee part type
Transition |  Transition part type
Cross |  Cross part type
Cap |  Cap part type
TapPerpendicular |  Tap perpendicular part type
TapAdjustable |  Tap adjustable part type
Offset |  Offset part type
Union |  Union part type
PanelBoard |  Panel board part type
Transformer |  Transformer part type
SwitchBoard |  Switch board part type
OtherPanel |  Other panel part type
EquipmentSwitch |  Equipment switch part type
Switch |  Switch part type
ValveBreaksInto |  Valve breaks into part type
SpudPerpendicular |  Spud perpendicular part type
SpudAdjustable |  Spud adjustable part type
Damper |  Damper part type
Wye |  Wye part type
LateralTee |  Lateral tee part type
LateralCross |  Lateral cross part type
Pants |  Pants part type
MultiPort |  Multi port part type
ValveNormal |  Valve normal part type
JunctionBoxTee |  JunctionBox tee part type
JunctionBoxCross |  JunctionBox cross part type
PipeFlange |  Pipe flange part type
JunctionBoxElbow |  JunctionBox elbow part type
ChannelCableTrayElbow |  Channel CableTray Elbow part type
ChannelCableTrayVerticalElbow |  Channel CableTray Vertical Elbow part type
ChannelCableTrayCross |  Channel CableTray Cross part type
ChannelCableTrayTee |  Channel CableTray Tee part type
ChannelCableTrayTransition |  Channel CableTray Transition part type
ChannelCableTrayUnion |  Channel CableTray Union part type
ChannelCableTrayOffset |  Channel CableTray Offset part type
ChannelCableTrayMultiPort |  Channel CableTray MultiPort part type
LadderCableTrayElbow |  Ladder CableTray Elbow part type
LadderCableTrayVerticalElbow |  Ladder CableTray Vertical Elbow part type
LadderCableTrayCross |  Ladder CableTray Cross part type
LadderCableTrayTee |  Ladder CableTray Tee part type
LadderCableTrayTransition |  Ladder CableTray Transition part type
LadderCableTrayUnion |  Ladder CableTray Union part type
LadderCableTrayOffset |  Ladder CableTray Offset part type
LadderCableTrayMultiPort |  Ladder CableTray MultiPort part type
InlineSensor |  Inline Sensor part type
Sensor |  Sensor part type
EndCap |  EndCap part type
HandrailBracketHardware |  Handrail Bracket Hardware part type
PanelBracketHardware |  Panel Bracket Hardware part type
TerminationHardware |  Termination Hardware part type
Rails |  Rails part type
Handrails |  Handrails part type
TopRails |  Top Rails part type
PipeMechanicalCoupling |  Pipe Mechanical Coupling part type
See Also
Autodesk.Revit.DB Namespace